cristobalgc/STM32_PID_CONTROLLER/PID_Regulator/Src/main.c
static const menu_item_T menu_changeSecondsOptions[1]={
		{0, menu_empty, menu_empty, MENU_exitChangeClockSelected},
};


/* Screen to Change Seconds */
static const menu_cfg_T menu_changeSeconds = {
		&Lcd_2,
		MENU_CHANGE_SECONDS,
		MENU_SCREEN_FREEZE,
		1, // Used Lines to print the menu
		1, // Print the entire menu rotating on this line
		59,// number of menu items
		0, //min menu start option
		&menu_changeSecondsOptions[0]
};

static const menu_item_T menu_changeWeekDayOptions[1]={
		{0, menu_empty, menu_empty, MENU_exitChangeClockSelected},
};

/* Screen to Change the day of the week */
static const menu_cfg_T menu_changeWeekDay = {
		&Lcd_2,
		MENU_CHANGE_WEEKDAY,
		MENU_SCREEN_FREEZE,
		1, // Used Lines to print the menu
		1, // Print the entire menu rotating on this line
		7, // number of menu items
		1, //min menu start option
		&menu_changeWeekDayOptions[0]
};

static const menu_item_T menu_changeMonthDayOptions[1]= {
		{0, menu_empty, menu_empty, MENU_exitChangeClockSelected},
};


/* Screen to Change the day of the current month*/
static const menu_cfg_T menu_changeMonthDay = {
		&Lcd_2,
		MENU_CHANGE_MONTHDAY,
		MENU_SCREEN_FREEZE,
		1, // Used Lines to print the menu
		1, // Print the entire menu rotating on this line
		31,// number of menu items
		1, //min menu start option
		&menu_changeMonthDayOptions[0]
};

static const menu_item_T menu_changeMonthOptions[1]={
		{0, menu_empty, menu_empty, MENU_exitChangeClockSelected},
};

/* Screen to Change the day of the current month*/
static const menu_cfg_T menu_changeMonth = {
		&Lcd_2,
		MENU_CHANGE_MONTH,
		MENU_SCREEN_FREEZE,
		1, // Used Lines to print the menu
		1, // Print the entire menu rotating on this line
		12,// number of menu items
		1, //min menu start option
		&menu_changeMonthOptions[0]
};

static const menu_item_T menu_changeYearOptions[1]={
	{0, menu_empty, menu_empty, MENU_exitChangeClockSelected},
};

/* Screen to Change the day of the current month*/
static const menu_cfg_T menu_changeYear = {
		&Lcd_2,
		MENU_CHANGE_YEAR,
		MENU_SCREEN_FREEZE,
		1, // Used Lines to print the menu
		1, // Print the entire menu rotating on this line
		100,// number of menu items
		21, //min menu start option
		&menu_changeYearOptions[0]
};

static const menu_item_T menu_changeKpEntireOptions[1]={
		{0, menu_empty, menu_empty, MENU_exitChangePidSelected},
};

/* Screen to Change the Entire part of the KP_ENTIRE parameter*/
static const menu_cfg_T menu_changeKpEntire = {
		&Lcd_2,
		MENU_CHANGE_KP_ENTIRE,
		MENU_SCREEN_FREEZE,
		1, // Used Lines to print the menu
		1, // Print the entire menu rotating on this line
		100,// number of menu items
		0, //min menu start option
		&menu_changeKpEntireOptions[0]
};

static const menu_item_T menu_changeKpDecimalOptions[1]={
		{0, menu_empty, menu_empty, MENU_exitChangePidSelected},
};

/* Screen to Change the decimal part of the KP_ENTIRE parameter*/
static const menu_cfg_T menu_changeKpDecimal = {
		&Lcd_2,
		MENU_CHANGE_KP_DECIMAL,
		MENU_SCREEN_FREEZE,
		1, // Used Lines to print the menu
		1, // Print the entire menu rotating on this line
		100,// number of menu items
		0, //min menu start option
		&menu_changeKpDecimalOptions[0]
};

static const menu_item_T menu_changeKiEntireOptions[1]={
		{0, menu_empty, menu_empty, MENU_exitChangePidSelected},
};

/* Screen to Change the Entire part of the KP_ENTIRE parameter*/
static const menu_cfg_T menu_changeKiEntire = {
		&Lcd_2,
		MENU_CHANGE_KI_ENTIRE,
		MENU_SCREEN_FREEZE,
		1, // Used Lines to print the menu
		1, // Print the entire menu rotating on this line
		100,// number of menu items
		0, //min menu start option
		&menu_changeKiEntireOptions[0]
};

static const menu_item_T menu_changeKiDecimalOptions[1]={
		{0, menu_empty, menu_empty, MENU_exitChangePidSelected},
};

/* Screen to Change the decimal part of the KP_ENTIRE parameter*/
static menu_cfg_T menu_changeKiDecimal = {
		&Lcd_2,
		MENU_CHANGE_KI_DECIMAL,
		MENU_SCREEN_FREEZE,
		1, // Used Lines to print the menu
		1, // Print the entire menu rotating on this line
		100,// number of menu items
		0, //min menu start option
		&menu_changeKiDecimalOptions[0]
};

static const menu_item_T menu_changeKdEntireOptions[1]=		{
		{0, menu_empty, menu_empty, MENU_exitChangePidSelected},
};

/* Screen to Change the Entire part of the KP_ENTIRE parameter*/
static const menu_cfg_T menu_changeKdEntire = {
		&Lcd_2,
		MENU_CHANGE_KD_ENTIRE,
		MENU_SCREEN_FREEZE,
		1, // Used Lines to print the menu
		1, // Print the entire menu rotating on this line
		100,// number of menu items
		0, //min menu start option
		&menu_changeKdEntireOptions[0]
};

static const menu_item_T menu_changeKdDecimalOptions[1]=		{
		{0, menu_empty, menu_empty, MENU_exitChangePidSelected},
};

/* Screen to Change the decimal part of the KP_ENTIRE parameter*/
static const menu_cfg_T menu_changeKdDecimal = {
		&Lcd_2,
		MENU_CHANGE_KD_DECIMAL,
		MENU_SCREEN_FREEZE,
		1, // Used Lines to print the menu
		1, // Print the entire menu rotating on this line
		100,// number of menu items
		0, //min menu start option
		&menu_changeKdDecimalOptions[0]
};

static const menu_item_T menu_changeSetPointEntireOptions[1]={
		{0, menu_empty, menu_empty, MENU_exitChangePidSelected},
};
/* Screen to Change the Entire part of the KP_ENTIRE parameter*/
static const menu_cfg_T menu_changeSetPointEntire = {
		&Lcd_2,
		MENU_CHANGE_SET_POINT_ENTIRE,
		MENU_SCREEN_FREEZE,
		1, // Used Lines to print the menu
		1, // Print the entire menu rotating on this line
		100,// number of menu items
		0, //min menu start option
		&menu_changeSetPointEntireOptions[0]
};

static const menu_item_T menu_changeSetPointDecimalOptions[1]={
		{0, menu_empty, menu_empty, MENU_exitChangePidSelected},
};

/* Screen to Change the decimal part of the KP_ENTIRE parameter*/
static const menu_cfg_T menu_changeSetPointDecimal = {
		&Lcd_2,
		MENU_CHANGE_SET_POINT_DECIMAL,
		MENU_SCREEN_FREEZE,
		1, // Used Lines to print the menu
		1, // Print the entire menu rotating on this line
		100,// number of menu items
		0, //min menu start option
		&menu_changeSetPointDecimalOptions[0]
};

static const menu_item_T menu_PidOptionsOptions[7] ={
		{0, submenu4_title, submenu4_title, NULL},
		{1, submenu4_op1, submenu4_op1_sel , menu_enterChangePidSelected},
		{2, submenu4_op2, submenu4_op2_sel, MENU_showPidValues},
		{3, menu_Exit, menu_Exit_sel, MENU_pidOptionsExitToMain},
};

/* Screen to show all PID options */
static menu_cfg_T menu_PidOptions = {
		&Lcd_2,
		MENU_PID_OPTIONS,
		MENU_SCREEN_NO_FREEZE,
		3, // Used Lines to print the menu
		1, // start printing the menu on this line
		3,// number of menu items
		1, //min menu start option
		&menu_PidOptionsOptions[0]
};

static const menu_item_T menu_clockOptionsOptions[7]=		{
		{0, submenu5_title, submenu5_title, NULL},
		{1, submenu5_op1, submenu5_op1_sel , MENU_enterChangeClockSelected},
		{2, submenu5_op2, submenu5_op2_sel, menu_enterChangeAlarmSelected},
		{3, menu_Exit, menu_Exit_sel, MENU_pidOptionsExitToMain},
};

/* Screen to show all PID options */
static menu_cfg_T menu_clockOptions = {
		&Lcd_2,
		MENU_CLOCK_OPTIONS,
		MENU_SCREEN_NO_FREEZE,
		3, // Used Lines to print the menu
		1, // Print the entire menu rotating on this line
		3,// number of menu items
		1, //min menu start option
		&menu_clockOptionsOptions[0]
};

