cristobalgc/STM32_PID_CONTROLLER/PID_Regulator/Src/main.c
static const menu_item_T menu_PidValuesOptions[4]={
		{0, submenu3_Kp, submenu3_Kp, MENU_exitAndNoSavePid},
		{1, submenu3_Ki, submenu3_Ki, MENU_exitAndNoSavePid},
		{2, submenu3_Kd, submenu3_Kd, MENU_exitAndNoSavePid},
		{3, submenu3_Sp, submenu3_Sp, MENU_exitAndNoSavePid},
};

/* Screen to show all PID options */
static const menu_cfg_T menu_PidValues = {
		&Lcd_2,
		MENU_PID_VALUES,
		MENU_SCREEN_NO_FREEZE,
		4, // Used Lines to print the menu
		0, // Print the entire menu rotating on this line
		3, // number of menu items
		0, //min menu start option
		&menu_PidValuesOptions[0]
};

static const menu_item_T menu_ChangeAlarmOptions[9]={
		{0, submenu6_op1, submenu6_op1, NULL},
		{1, menu_empty, submenu6_op2, menu_ChangeAlarmHourFormatSel},
		{2, menu_empty, submenu6_op3, menu_ChangeAlarmAmPmSel},
		{3, menu_empty, submenu6_op4, menu_ChangeAlarmHourSel},
		{4, menu_empty, submenu6_op5, menu_ChangeAlarmMinSel},
		{5, menu_empty, submenu6_op6, menu_ChangeAlarmSecSel},
		{6, menu_empty, submenu6_op7, menu_ChangeAlarmStatusSel},
		{7, menu_empty, submenu6_op8, menu_exitAndSaveAlarm},
		{8, menu_empty, submenu6_op9, menu_exitAndNoSaveAlarm}
};

/* Screen to Change Hours*/
static const menu_cfg_T menu_ChangeAlarm = {
		&Lcd_2,
		MENU_ALARM_SETTINGS,
		MENU_SCREEN_NO_FREEZE,
		1, // Used Lines to print the menu
		1, // Print the entire menu rotating on this line
		8,// number of menu items
		1, //min menu start option
		&menu_ChangeAlarmOptions[0]
};

static const menu_item_T menu_changeAlarmHourAmPmOptions[1]={
		{0, menu_empty, menu_empty, menu_exitChangeAlarmSelected},
};

/* Screen to Change Alarm Hour mode */
static const  menu_cfg_T menu_changeAlarmHourAmPm = {
		&Lcd_2,
		MENU_CHANGE_ALARM_HOUR_AM_PM,
		MENU_SCREEN_FREEZE,
		1, // Used Lines to print the menu
		1, // Print the entire menu rotating on this line
		1,// number of menu items
		0, //min menu start option
		&menu_changeAlarmHourAmPmOptions[0]
};

static const menu_item_T menu_changeAlarmHourFormatOptions[1]={
		{0, menu_empty, menu_empty, menu_exitChangeAlarmSelected},
};

/* Screen to Change Hour format */
static const menu_cfg_T menu_changeAlarmHourFormat = {
		&Lcd_2,
		MENU_CHANGE_ALARM_HOUR_FORMAT,
		MENU_SCREEN_FREEZE,
		1, // Used Lines to print the menu
		1, // Print the entire menu rotating on this line
		1,// number of menu items
		0, //min menu start option
		&menu_changeAlarmHourFormatOptions[0]
};

static const menu_item_T menu_changeAlarmHoursOptions[1]={
		{0, menu_empty, menu_empty, menu_exitChangeAlarmSelected},
};

/* Screen to Change Hours */
static const menu_cfg_T menu_changeAlarmHours = {
		&Lcd_2,
		MENU_CHANGE_ALARM_HOUR,
		MENU_SCREEN_FREEZE,
		1, // Used Lines to print the menu
		1, // Print the entire menu rotating on this line
		23,// number of menu items
		0, //min menu start option
		&menu_changeAlarmHoursOptions[0]
};

static const menu_item_T menu_changeAlarmMinutesOptions[1]={
		{0, menu_empty, menu_empty, menu_exitChangeAlarmSelected},
};

/* Screen to Change Hours */
static const menu_cfg_T menu_changeAlarmMinutes = {
		&Lcd_2,
		MENU_CHANGE_ALARM_MINUTES,
		MENU_SCREEN_FREEZE,
		1, // Used Lines to print the menu
		1, // Print the entire menu rotating on this line
		59,// number of menu items
		0, //min menu start option
		&menu_changeAlarmMinutesOptions[0]
};

static const menu_item_T menu_changeAlarmSecondsOptions[1]={
		{0, menu_empty, menu_empty, menu_exitChangeAlarmSelected},
};

/* Screen to Change Hours */
static const menu_cfg_T menu_changeAlarmSeconds = {
		&Lcd_2,
		MENU_CHANGE_ALARM_SECONDS,
		MENU_SCREEN_FREEZE,
		1, // Used Lines to print the menu
		1, // Print the entire menu rotating on this line
		59,// number of menu items
		0, //min menu start option
		&menu_changeAlarmSecondsOptions[0]
};

static const menu_item_T menu_changeAlarmStatusOptions[1]={
		{0, menu_empty, menu_empty, menu_exitChangeAlarmSelected},
};

/* Screen to Change Hours */
static const menu_cfg_T menu_changeAlarmStatus = {
		&Lcd_2,
		MENU_CHANGE_ALARM_STATUS,
		MENU_SCREEN_FREEZE,
		1, // Used Lines to print the menu
		1, // Print the entire menu rotating on this line
		1,// number of menu items
		0, //min menu start option
		&menu_changeAlarmStatusOptions[0]
};

static const menu_cfg_T *menu_configs[33]={
		&menu_defaultPid,			//0
		&menu_defaultPid,			//1
		&menu_defaultHour,			//2
		&menu1_cfg,					//3
		&menu_PidOptions,			//4
		&menu_ChangeDateTime,		//5
		&menu_changeHourFormat,		//6
		&menu_changeHourAmPm,		//7
		&menu_changeHours,			//8
		&menu_changeMinutes,		//9
		&menu_changeSeconds,		//10
		&menu_changeWeekDay,		//11
		&menu_changeMonthDay,		//12
		&menu_changeMonth,			//13
		&menu_changeYear,			//14
		&menu_ChangePidSettings,	//15
		&menu_changeKpEntire,		//16
		&menu_changeKpDecimal,		//17
		&menu_changeKiEntire,		//18
		&menu_changeKiDecimal,		//19
		&menu_changeKdEntire,		//20
		&menu_changeKdDecimal,		//21
		&menu_changeSetPointEntire,	//22
		&menu_changeSetPointDecimal,//23
		&menu_PidValues,			//24
		&menu_clockOptions,			//25
		&menu_ChangeAlarm,			//26
		&menu_changeAlarmHourFormat,//27
		&menu_changeAlarmHourAmPm,  //28
		&menu_changeAlarmHours,		//29
		&menu_changeAlarmMinutes,  //30
		&menu_changeAlarmSeconds,//31
		&menu_changeAlarmStatus,//32
};

static uint32_t i2c_TxInterrupts = 0;
static uint32_t i2c_RxInterrupts = 0;
static uint32_t Uart_TxInterrupts = 0;
uint8_t Rx_indx,Transfer_cplt;
char Rx_data[2],Rx_Buffer[100];
static uint16_t adc_buffer[ADC_BUFFER_LEN];
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_I2C1_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM2_Init(void);
static void MX_DMA_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_TIM4_Init(void);
static void MX_SPI1_Init(void);
static void MX_ADC1_Init(void);
static void MX_TIM1_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
	menu_status_t menuStatus = MENU_DEFAULT_CFG;
	//check if the interrupt comes from TIM4
	if(htim->Instance == TIM4){
		HAL_TIM_Base_Stop_IT(&htim4);
		__HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_4);
		HAL_NVIC_EnableIRQ(EXTI4_IRQn);
	}

