cristobalgc/STM32_PID_CONTROLLER/PID_Regulator/Src/main.c
	//check if the interrupt comes from TIM1
	if(htim->Instance == TIM1){
		menuStatus = MENU_GetStatus(&menu);
		HAL_GPIO_TogglePin(GPIOC, GPIO_PIN_13);
		if ((menuStatus == MENU_DEFAULT_HOUR) || (menuStatus == MENU_DEFAULT_PID)){
			MENU_Task(&menu);
		}
		flag_timer3 = 1u;
	}
}

void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef* hadc){
	if(hadc->Instance == ADC1){
		PID_control(&Pid, adc_buffer[0]);
		MENU_SetAdcValue(&menu, PID_GetAdcValule(&Pid));
		MENU_SetDutyCycle(&menu, PID_GetDutyValule(&Pid));
	}
}

void HAL_TIM_IC_CaptureCallback(TIM_HandleTypeDef *htim)
{
	menu_status_t menuStatus = MENU_DEFAULT_CFG;

	if (htim->Instance == TIM2) //check if the interrupt comes from TIM2
	{
		if(HAL_TIM_Encoder_GetState(&htim2) == HAL_TIM_STATE_READY)
		{
			menuStatus = MENU_GetStatus(&menu);
			SDBG_print(&huart1,"\r\nEncoder: %d", TIM2->CNT);
			MENU_encoderOption (&menu, (int32_t)TIM2->CNT);

			if (( menuStatus!= MENU_DEFAULT_HOUR) && (menuStatus != MENU_DEFAULT_PID)){
				MENU_Task(&menu);
			}
		}
	}
}

void HAL_I2C_MasterTxCpltCallback(I2C_HandleTypeDef *hi2c)
{
	if(hi2c->Instance == I2C1)
	{
		i2c_TxInterrupts++;
	}
}

void HAL_I2C_MasterRxCpltCallback(I2C_HandleTypeDef *hi2c)
{
	if(hi2c->Instance == I2C1)
	{
		i2c_RxInterrupts++;
	}
}

void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
{
	if(huart->Instance == USART1)
	{
		Uart_TxInterrupts++;
	}
}

void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
	uint8_t i;
	if(huart->Instance == USART1)//Current UART
	{
		if(Rx_indx == 0)
		{
			for(i=0; i<100; i++)
			{
				Rx_Buffer[i]=0; //Clear rx_Buffer prior to use
			}
			//reset the user led if previously set
			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_RESET);
		}
		if(Rx_data[0]!=13)
		{
			Rx_Buffer[Rx_indx++] = Rx_data[0]; //add data to rxbuffer
		}
		else // if received data =13 (carriage return)
		{
			Rx_indx =0;
			Transfer_cplt =1; // transfer complete, data is ready
			HAL_UART_Transmit_DMA(&huart1,(uint8_t*)Rx_Buffer,(uint16_t)strlen(Rx_Buffer));
			HAL_UART_Transmit_DMA(&huart1,(uint8_t*)"\n\r",2u);
			if(!strcmp(Rx_Buffer,"On"))// LED trigger phase
			{
				HAL_GPIO_WritePin(GPIOC, GPIO_PIN_13, GPIO_PIN_SET);
			}
		}
		HAL_UART_Receive_DMA(&huart1,(uint8_t*)Rx_data,1u);// activate UART
		HAL_UART_Transmit_DMA(&huart1,(uint8_t*)Rx_data,(uint16_t)strlen(Rx_data));
	}
}


void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
	//static uint32_t counter = 0u;

	if (GPIO_Pin == GPIO_PIN_4){
		//counter++;
		HAL_NVIC_DisableIRQ(EXTI4_IRQn);
		HAL_TIM_Base_Start_IT(&htim4);
		if((HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_4) == GPIO_PIN_RESET)){
			/* Falling edge */
			MENU_keyPressed(&menu);
			MENU_Task(&menu);
		}else{
			/* Rising edge */
			//counter = 0u;
		}
		//LCD_setCursor(&Lcd_2,17,0);
		//LCD_print(&Lcd_2,"%d",counter);
	}
}

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */
  

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_I2C1_Init();
  MX_TIM3_Init();
  MX_TIM2_Init();
  MX_DMA_Init();
  MX_USART1_UART_Init();
  MX_TIM4_Init();
  MX_SPI1_Init();
  MX_ADC1_Init();
  MX_TIM1_Init();
  /* USER CODE BEGIN 2 */
	(void)HAL_UART_Receive_DMA(&huart1, (uint8_t*)Rx_data, 1u);
	LCD_init(&Lcd_2, &Lcd_Hd44780I2cCfg); /* Initialize the LCD to print "normal characters"*/
	BIGFONT_init(&Lcd_2); /*Initialize Big font characters */
	LCD_setBacklight(&Lcd_2, 1u); /* Turn on the Backlight */
	DS1302_Init(&rtc, &ds1302_config);
	DS1302_setTime(&rtc, HOUR_FORMAT, HOUR, MINUTES, SECONDS, AM_PM, WEEKDAY, MONTHDAY, MONTH, YEAR);
	SDBG_print(&huart1,"\r\nHello World!");
	MENU_Init(&menu, &menu_configs, &menu_dateTimeCfg, &menu_alarmCfg, &menuPidCfg);
	PID_init(&Pid, &pidcfg);

	if(HAL_OK != HAL_ADCEx_Calibration_Start(&hadc1)){
		Error_Handler();
	}

	if(HAL_OK != HAL_ADC_Start_DMA(&hadc1, (uint32_t*)&adc_buffer, ADC_BUFFER_LEN)){
		Error_Handler();
	}

	if(HAL_OK != HAL_TIM_Base_Start(&htim3)){
		Error_Handler();
	}

	if(HAL_OK != HAL_TIM_Base_Start_IT(&htim1)){
		Error_Handler();
	}

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
	while (1)
	{
		if(flag_timer3){
			DS1302_updateDateTime(&rtc);

			MENU_SetSecondUnits(&menu, DS1302_getSecondsUnits(&rtc));
			MENU_SetSecondDec(&menu, DS1302_getSecondsDec(&rtc));
			MENU_SetMinutesUnits(&menu, DS1302_getMinutesUnits(&rtc));
			MENU_SetMinutesDec(&menu, DS1302_getMinutesDec(&rtc));
			MENU_SetHourUnits(&menu, DS1302_getHourUnits(&rtc));
			MENU_SetHourDec(&menu, DS1302_getHourDec(&rtc));
			MENU_SetAmPm(&menu, DS1302_getAmPmStatus(&rtc));
			MENU_SetWeekday(&menu, DS1302_geWeekDay(&rtc));
			MENU_SetMonth(&menu, DS1302_getMonth(&rtc));
			MENU_SetMonthDay(&menu,DS1302_getMonthDay(&rtc));
			MENU_SetYear(&menu, DS1302_getYear(&rtc));
			flag_timer3 = 0;
		}

		if(menu_GetChangesDataTime(&menu)){
			DS1302_setTime(&rtc, menu.data.dateTimeCfg.hourFormat, menu.data.dateTimeCfg.hour, menu.data.dateTimeCfg.minutes, menu.data.dateTimeCfg.seconds,
					menu.data.dateTimeCfg.amPm, menu.data.dateTimeCfg.dayOfWeek, menu.data.dateTimeCfg.dayOfMonth, menu.data.dateTimeCfg.month, menu.data.dateTimeCfg.year);
		}

		if(menu_GetChangesPid(&menu)){
			PID_SetSetPointVal(&Pid, menu.data.SetPointEntire, 0U);
			PID_SetParameters(&Pid, menu.data.kpEntire, menu.data.kpDecimal,
					menu.data.kiEntire, menu.data.kiDecimal,
					menu.data.kdEntire, menu.data.kdDecimal);
		}

		if(menu_checkAlarm(&menu)){

		}

    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
	}
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};
  RCC_PeriphCLKInitTypeDef PeriphClkInit = {0};

  /** Initializes the CPU, AHB and APB busses clocks 
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }
  /** Initializes the CPU, AHB and APB busses clocks 
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
  {
    Error_Handler();
  }
  PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_ADC;
  PeriphClkInit.AdcClockSelection = RCC_ADCPCLK2_DIV8;
  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief ADC1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_ADC1_Init(void)
{

  /* USER CODE BEGIN ADC1_Init 0 */

